# Brewfile — generated by mac-setup spec
# Install all: brew bundle --file=Brewfile

# CLI tools
brew "git"
brew "gh"
brew "jq"
brew "tree"
brew "fzf"
brew "htop"
brew "wget"
brew "tldr"
brew "eza"
brew "zoxide"
brew "bat"
brew "gnupg"
brew "pinentry-mac"
brew "mas"
brew "mise"
brew "watchman"
brew "cocoapods"
brew "awscli"

# Shell prompt
brew "starship"

# Fonts
cask "font-meslo-lg-nerd-font"

# Development
cask "visual-studio-code"
cask "cursor"
cask "zed"
cask "android-studio"
cask "iterm2"
cask "ghostty"
cask "docker"
cask "reactotron"
cask "postman"

# AI & LLM Development
brew "ollama"
cask "lm-studio"

# Browsers
cask "google-chrome"
cask "firefox"

# Productivity
cask "microsoft-office"
cask "notion"
cask "obsidian"
cask "zoom"
cask "raycast"
cask "rectangle"
cask "1password"

# Communication
cask "telegram"
cask "whatsapp"
cask "discord"

# Cloud Storage
cask "google-drive"

# Media
cask "spotify"
cask "vlc"
cask "iina"

# Utilities
cask "appcleaner"
cask "the-unarchiver"
cask "keka"
cask "alt-tab"
cask "stats"
cask "keepingyouawake"

# Security
cask "adguard"
cask "adguard-vpn"

# Mac App Store
mas "Xcode", id: 497799835

# Not in Homebrew (installed via DMG in setup.sh)
# Moonlock (MacPaw) — https://macpaw.com/download/moonlock
